# Chapter 8 練習と総合問題解答

## 8.2 SQLの基礎

### 8.2.1 データベースとテーブルの作成

#### <練習問題 1>

セルを追加（左上にある＋を押下）して、今あるデータベースを表示させましょう。そして、新しいデータベース（TEST2など）を作って、そのデータベースを使うように選択しましょう。

In [12]:
/*解答*/
show databases;

,Database
0,TEST1
1,TEST2
2,employees
3,foodmart
4,information_schema
5,mysql
6,performance_schema
7,sakila
8,world

In [13]:
/*解答*/
create database TEST2;
use TEST2;

Traceback (most recent call last):
  File "/opt/conda/lib/python3.6/site-packages/mysql_kernel.py", line 51, in do_execute
    html = self.execute_sql(code)
  File "/opt/conda/lib/python3.6/site-packages/mysql_kernel.py", line 72, in execute_sql
    for sub_cursor in self.cursor.execute(sql, multi=True):
  File "/opt/conda/lib/python3.6/site-packages/mysql/connector/cursor.py", line 494, in _execute_iter
    result = next(query_iter)
  File "/opt/conda/lib/python3.6/site-packages/mysql/connector/connection.py", line 526, in cmd_query_iter
    yield self._handle_result(self._send_cmd(ServerCmd.QUERY, statements))
  File "/opt/conda/lib/python3.6/site-packages/mysql/connector/connection.py", line 396, in _handle_result
    raise errors.get_exception(packet)
mysql.connector.errors.DatabaseError: 1007 (HY000): Can't create database 'TEST2'; database exists

#### <練習問題 2>

練習問題１で作成、選択したデータベースに新しいテーブル「meibo2」を作成してください。作成後はテーブルが完成しているか、確認しましょう。

In [14]:
/*解答*/
create table meibo2
  (id int primary key, name varchar(20))
  engine = MyISAM
  default charset = utf8;

Traceback (most recent call last):
  File "/opt/conda/lib/python3.6/site-packages/mysql_kernel.py", line 51, in do_execute
    html = self.execute_sql(code)
  File "/opt/conda/lib/python3.6/site-packages/mysql_kernel.py", line 72, in execute_sql
    for sub_cursor in self.cursor.execute(sql, multi=True):
  File "/opt/conda/lib/python3.6/site-packages/mysql/connector/cursor.py", line 494, in _execute_iter
    result = next(query_iter)
  File "/opt/conda/lib/python3.6/site-packages/mysql/connector/connection.py", line 526, in cmd_query_iter
    yield self._handle_result(self._send_cmd(ServerCmd.QUERY, statements))
  File "/opt/conda/lib/python3.6/site-packages/mysql/connector/connection.py", line 396, in _handle_result
    raise errors.get_exception(packet)
mysql.connector.errors.ProgrammingError: 1050 (42S01): Table 'meibo2' already exists

In [15]:
/*解答*/
show tables;

,Tables_in_TEST1
0,meibo
1,meibo2
2,score
3,v1
4,v2
5,v3

#### <練習問題 3>

新しく作ったテーブルにデータを追加してみましょう。追加後は、確かにデータが入っているか確認してください。

In [16]:
/*解答*/
insert into meibo2 (id, name) values (1, "Saito");
insert into meibo2 (id, name) values (2, "Murakami");
insert into meibo2 (id, name) values (3, "Inoue");

In [17]:
/*解答*/
select * from meibo2;

,id,name,class,age
0,1,Saito,None,None
1,2,Murakami,None,None
2,3,Inoue,None,None

### 8.2.2 データの検索と更新、テーブルカラムの変更

#### <練習問題 1>

TEST1のデータベースを選択して、上記のテーブルmeiboにて、id=4の人レコードを抽出してください。

In [18]:
/*解答*/
use TEST1;

In [19]:
/*解答*/
select * from meibo where id=4;

,id,name,class,age
0,4,Kato,2,15

#### <練習問題 2>

上のmeiboテーブルでid=8の人のclassを7にアップデートしてください。select文でアップデートを確認できたら、id=8の人のclassを1に戻してください。

In [20]:
/*解答*/
update meibo
 set class = 7
 where id=8;

In [21]:
/*解答*/
select * from meibo;

,id,name,class,age
0,1,Yamada,1,14
1,2,Tanaka,2,13
2,3,Suzuki,1,13
3,4,Kato,2,15
4,5,Ito,3,12
5,6,Takeuchi,2,16
6,7,Kimura,3,11
7,8,Sato,7,14
8,100,dummy_Yamada,None,None
9,200,dummy_Tanaka,None,None
10,300,dummy_Sato,None,None

In [22]:
/*解答*/
update meibo
 set class = 1
 where id=8;

In [23]:
/*解答*/
select * from meibo;

,id,name,class,age
0,1,Yamada,1,14
1,2,Tanaka,2,13
2,3,Suzuki,1,13
3,4,Kato,2,15
4,5,Ito,3,12
5,6,Takeuchi,2,16
6,7,Kimura,3,11
7,8,Sato,1,14
8,100,dummy_Yamada,None,None
9,200,dummy_Tanaka,None,None
10,300,dummy_Sato,None,None

#### <練習問題 3>

上記と同じテーブルmeiboに新しい列heightという身長を追加してください。さらに、id=1から4までの人は150、id=5から6までの人は155、id=7から8までの人は160でアップデートしてください。

In [24]:
/*解答*/
alter table meibo add height int;

In [25]:
/*解答*/
select * from meibo;

,id,name,class,age,height
0,1,Yamada,1,14,None
1,2,Tanaka,2,13,None
2,3,Suzuki,1,13,None
3,4,Kato,2,15,None
4,5,Ito,3,12,None
5,6,Takeuchi,2,16,None
6,7,Kimura,3,11,None
7,8,Sato,1,14,None
8,100,dummy_Yamada,None,None,None
9,200,dummy_Tanaka,None,None,None
10,300,dummy_Sato,None,None,None

In [26]:
/*解答*/
update meibo
 set height=150
 where id<=4;

update meibo
 set height=155
 where id>=5 and id<=6;
 
update meibo
 set height=160
 where id>=7;

In [27]:
/*解答*/
select * from meibo;

,id,name,class,age,height
0,1,Yamada,1,14,150
1,2,Tanaka,2,13,150
2,3,Suzuki,1,13,150
3,4,Kato,2,15,150
4,5,Ito,3,12,155
5,6,Takeuchi,2,16,155
6,7,Kimura,3,11,160
7,8,Sato,1,14,160
8,100,dummy_Yamada,None,None,160
9,200,dummy_Tanaka,None,None,160
10,300,dummy_Sato,None,None,160

### 8.2.3 データの集計、演算、並び替え

#### <練習問題 1>
上記と同じmeiboテーブルで、異なる年齢は何種類でしょうか。

In [28]:
/* 解答 */
select count(distinct age) as ageCnt from meibo;

,ageCnt
0,6

#### <練習問題 2>
身長が一番小さい人、大きい人の身長をそれぞれ求めてください。

In [29]:
select min(height) as minHeight, max(height) as maxHeight from meibo;

,minHeight,maxHeight
0,150,160

#### <練習問題 3>
身長が155以上で、classが3のレコードを抽出してください。

In [30]:
select * from meibo where height>=155 and class=3;

,id,name,class,age,height
0,5,Ito,3,12,155
1,7,Kimura,3,11,160

### 8.2.4 グループごとの集計

#### <練習問題 1>

meiboテーブルにて、クラスごとの平均身長を求めてみましょう。

In [31]:
/* 解答 */
select class, avg(height) as avgHeight from meibo group by class;

,class,avgHeight
0,None,160.0000
1,1,153.3333
2,2,151.6667
3,3,157.5000

#### <練習問題 2>

上に加えて、クラスごとの人数、一番小さい人と、一番大きな人の身長もそれぞれのクラスで算出しましょう。

In [32]:
/* 解答 */
select class,count(*) as cnt, min(height) as minHeight,max(height) as maxHeight from meibo group by class;

,class,cnt,minHeight,maxHeight
0,None,3,160,160
1,1,3,150,160
2,2,3,150,155
3,3,2,155,160

#### <練習問題 3>

年齢が13歳より上の人に絞って、上記と同じ項目を求めてください。

In [33]:
/* 解答 */
select class,count(*) as cnt, min(height) as minHeight,max(height) as maxHeight from meibo where age > 13 group by class;

,class,cnt,minHeight,maxHeight
0,1,2,150,160
1,2,2,150,155

### 8.2.5 複数テーブルの利用

#### <練習問題 1>

新しくcardtbというテーブルを作成してください。ただし、カラムはid,point,money (すべてint)にしてください。さらに、以下のデータを挿入してください。<br>(id,point,money) = (1,100,1000),(2,NULL,60),(3,50,500),(4,30,600),(5,10,10),(6,NULL,40),(7,100,1000),(8,2000,100)

In [34]:
/* 解答 */
create table cardtb
  (id int primary key, point int, money int)
  engine = MyISAM
  default charset = utf8;

In [35]:
/* 解答 */
desc cardtb;

,Field,Type,Null,Key,Default,Extra
0,id,int(11),NO,PRI,None,
1,point,int(11),YES,,None,
2,money,int(11),YES,,None,

データの挿入です。

In [36]:
/* 解答 */
insert into cardtb (id,point,money) 
values (1,100,1000),(3,50,500),(4,30,600),(5,10,10),(7,100,1000),(8,2000,100);

In [37]:
/* 解答 */
select * from cardtb;

,id,point,money
0,1,100,1000
1,3,50,500
2,4,30,600
3,5,10,10
4,7,100,1000
5,8,2000,100

#### <練習問題 2>

meiboテーブルにidをキーとして、上記のテーブルを内部結合させてください。

In [38]:
select * from meibo a join cardtb b on a.id=b.id;

,id,name,class,age,height,id,point,money
0,1,Yamada,1,14,150,1,100,1000
1,3,Suzuki,1,13,150,3,50,500
2,4,Kato,2,15,150,4,30,600
3,5,Ito,3,12,155,5,10,10
4,7,Kimura,3,11,160,7,100,1000
5,8,Sato,1,14,160,8,2000,100

内部結合の場合、cardtbに同じidのレコードが存在しなかったため、meiboテーブルのid=2,6のレコードは表示されません。

#### <練習問題 3>
meiboテーブルにidをキーとして、上記のテーブルを外部結合させてください。

In [39]:
select * from meibo a left join cardtb b on a.id=b.id;

,id,name,class,age,height,id,point,money
0,1,Yamada,1,14,150,1,100,1000
1,2,Tanaka,2,13,150,None,None,None
2,3,Suzuki,1,13,150,3,50,500
3,4,Kato,2,15,150,4,30,600
4,5,Ito,3,12,155,5,10,10
5,6,Takeuchi,2,16,155,None,None,None
6,7,Kimura,3,11,160,7,100,1000
7,8,Sato,1,14,160,8,2000,100
8,100,dummy_Yamada,None,None,160,None,None,None
9,200,dummy_Tanaka,None,None,160,None,None,None
10,300,dummy_Sato,None,None,160,None,None,None

外部結合の場合、cardtbに同じidのレコードが存在しなくても、meiboテーブルのすべてのレコードが表示されます。cardtbに存在しなかったidについてはNULLが入っています(Noneと表示されている部分です)

### 8.2.6 case文とサブクエリ

#### <練習問題 1>

meiboテーブルで、heightが155未満の場合は"below_155"、155ぴったりならば"equal_155"、155より大きいならば"over_155"と名付けて、テーブルを表示させてください。

In [40]:
/*解答*/
select 
     id
    ,name
    ,case 
        when height <155 then "below_155"
        when height = 155 then "equal_155"
        when height > 155 then "over_155"
        else "others" 
    end as heightLevel
from 
    meibo;

,id,name,heightLevel
0,1,Yamada,below_155
1,2,Tanaka,below_155
2,3,Suzuki,below_155
3,4,Kato,below_155
4,5,Ito,equal_155
5,6,Takeuchi,equal_155
6,7,Kimura,over_155
7,8,Sato,over_155
8,100,dummy_Yamada,over_155
9,200,dummy_Tanaka,over_155
10,300,dummy_Sato,over_155

#### <練習問題 2>
上記のテーブルとサブクエリの考え方を利用して、それぞれのheightLevelの人数を求めてください。

In [41]:
/*解答*/
select b.heightLevel,count(*) as cnt 
from
(select 
     id
    ,name
    ,case 
        when height <155 then "below_155"
        when height = 155 then "equal_155"
        when height > 155 then "over_155"
        else "others" 
    end as heightLevel
from 
    meibo) b
group by heightLevel;

,heightLevel,cnt
0,below_155,4
1,equal_155,2
2,over_155,5

#### <練習問題 3>
上記のテーブルとサブクエリの考え方を利用して、それぞれのheightLevelの平均年齢を求めてください。

In [42]:
/*解答*/
select b.heightLevel,avg(age) as avgAge
from
(select 
     id
    ,name
    ,age
    ,case 
        when height <155 then "below_155"
        when height = 155 then "equal_155"
        when height > 155 then "over_155"
        else "others" 
    end as heightLevel
from 
    meibo) b
group by heightLevel;

,heightLevel,avgAge
0,below_155,13.7500
1,equal_155,14.0000
2,over_155,12.5000

## 8.3 ビュー

### 8.3.1 ビュー

#### <練習問題 1>
テーブルmeibo2からidとnameを取り出して、ビューのv3を作成してみましょう。

In [48]:
use TEST1;

In [49]:
/*解答*/
create view v3
    as
select id,name
    from meibo2;

In [50]:
/*解答*/
select * from v3;

,id,name
0,1,Yamada
1,9,Nagata
2,10,Sugino
3,11,Takayama
4,12,John

#### <練習問題 2>
meiboテーブルとscoreテーブルを外部結合して、idとnameを取り出すビューv4を作成してみましょう。

In [51]:
/* 解答 */
create view v4
    as
select a.id,a.name from meibo a left join score b on a.id=b.id;

In [52]:
/* 解答 */
select * from v4;

,id,name
0,1,Yamada
1,2,Tanaka
2,3,Suzuki
3,4,Kato
4,5,Ito
5,6,Takeuchi
6,7,Kimura
7,8,Sato
8,100,dummy_Yamada
9,200,dummy_Tanaka
10,300,dummy_Sato

#### <練習問題 3>
上記で作成したテーブルに新しいデータを追加してみましょう。どうなりますか？

In [53]:
/*解答：エラーになります。ビューはいつでも更新できるわけではない。*/
insert into v4 (id, name) values (101, "dummy2_Yamada");
insert into v4 (id, name) values (201, "dummy2_Tanaka");
insert into v4 (id, name) values (301, "dummy2_Sato");

Traceback (most recent call last):
  File "/opt/conda/lib/python3.6/site-packages/mysql_kernel.py", line 51, in do_execute
    html = self.execute_sql(code)
  File "/opt/conda/lib/python3.6/site-packages/mysql_kernel.py", line 72, in execute_sql
    for sub_cursor in self.cursor.execute(sql, multi=True):
  File "/opt/conda/lib/python3.6/site-packages/mysql/connector/cursor.py", line 494, in _execute_iter
    result = next(query_iter)
  File "/opt/conda/lib/python3.6/site-packages/mysql/connector/connection.py", line 526, in cmd_query_iter
    yield self._handle_result(self._send_cmd(ServerCmd.QUERY, statements))
  File "/opt/conda/lib/python3.6/site-packages/mysql/connector/connection.py", line 396, in _handle_result
    raise errors.get_exception(packet)
mysql.connector.errors.DatabaseError: 1471 (HY000): The target table v4 of the INSERT is not insertable-into

***

## 8.4 総合問題

### 8.4.1 総合問題1

以下のデータベースを使って、後の問いに答えてください。

https://dev.mysql.com/doc/world-setup/en/

(1) データベースworldを選択して、どのようなテーブルがあるか、またそれぞれどのようなカラムがあるか表示してください。  
(2) それぞれのテーブルについて、それぞれ5行ずつ表示させてください。どんなデータがあるか軽く確認してください。  
(3) cityテーブルについて、レコード数をカウントしてください。また、重複するデータがあるかどうか、チェックしてください。

In [37]:
/*解答　(1)*/
show databases;
use world;

show tables;

desc city;
desc country;
desc countrylanguage;

In [38]:
/*解答　(2)*/
select * from city limit 5;
select * from country limit 5;
select * from countrylanguage limit 5;

In [39]:
/*解答　(3)*/
/*重複はなし*/
select count(*) as all_record, count(distinct ID) as distinct_ID from city;

,all_record,distinct_ID
0,4079,4079

### 8.4.2 総合問題2
上記と同じデータベースを使って、以下の問いに答えてください。

(1) countrylanguageテーブルについて、それぞれのCountryCodeを軸に、言語の数（テーブルにあるものだけ、重複なく）を計算してください。また、その結果をcityテーブルに紐付けて（joinして）、cityのカラム全てとその言語の数を表示してください。ただし、結果は5行のみ表示させるだけでよいです。  
(2)  countrylanguageテーブルについて、それぞれのCountryCodeを軸に、Percentageを合計してください。ただし、その合計値が99.9を超えるものだけ表示させるようにしてください。  
(3)  cityテーブルについて、DistrictのイニシャルがAではじまるもの、Bではじまるもの、Cではじまるもの、その他(others)の4パターンに分けて、それぞれのレコード数をカウントしてください。

In [40]:
/*解答(1)*/
select a.*,b.lang_cnt from city a left outer join 
(select CountryCode,count(distinct Language) as lang_cnt from countrylanguage group by 1) b
on a.CountryCode = b.CountryCode limit 5;

,ID,Name,CountryCode,District,Population,lang_cnt
0,1,Kabul,AFG,Kabol,1780000,5
1,2,Qandahar,AFG,Qandahar,237500,5
2,3,Herat,AFG,Herat,186800,5
3,4,Mazar-e-Sharif,AFG,Balkh,127800,5
4,5,Amsterdam,NLD,Noord-Holland,731200,4

In [41]:
/*解答(2)*/
select CountryCode, sum(Percentage) all_P from countrylanguage group by 1 having all_P>99.9 limit 5;

,CountryCode,all_P
0,BHS,100
1,BMU,100
2,BTN,100
3,CHL,100
4,CPV,100

In [42]:
/*解答(3)*/
select 
    case
        when District like 'A%' then "FromA"
        when District like 'B%' then "FromB"
        when District like 'C%' then "FromC"
        else "others" 
    end as initial_District,
    count(*) as cnt
from 
    city
    group by 1;

,initial_District,cnt
0,FromA,273
1,FromB,217
2,FromC,326
3,others,3263